---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelCodeChecking
source: html/6558e7b5-b374-2ccc-827d-105c308a8359.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelCodeChecking Property

"Code Checking": Used for Analytical wall, Analytical beam, Analytical column, Analytical floor, Analytical wall foundations, Analytical isolated foundations, Analytical foundations slab, Anaytical brace

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalModelCodeChecking { get; }
```